//Напишите программу, которая на вход принимает число (N), а на выходе показывает все четные числа от 1 до N/
int numberN = 10;
int numberB = 0;
while (numberB<(numberN-1))
{
    numberB+=2;
Console.WriteLine(numberB);
}

