//Напишите программу, которая на выходе выдат треью цифру числа.
System.Console.WriteLine ("Введите число");
int number = Convert.ToInt32(Console.ReadLine());
if (number > 100 );
{
    Console.WriteLine (number % 1000 /100);
}
