//Напишите программу, которая на вход принимат число и выдает, является ли число четным (делится ли оно на два без остатка)
int number = 4;
if (number % 2 ==0)
{
Console.WriteLine("yes");
}
else 
{
    Console.WriteLine("no");
}