// Напишите программу, которая принимает на вход пятизначное 
//число и проверяет, является ли оно палиндромом.
//14212 -> нет
//12821 -> да

 void Palindrom (double a, double j, double x, double y, double z)
        {
            if (j == y && a == z) 
            {
                Console.WriteLine("да");
            }
            else
            {
                Console.WriteLine("нет");
            }
        }
        Palindrom(2, 2, 3, 2, 1);
    
